# Доленко Дарья, РУДН, НБИбд-01-21, 25.06.22
# Задание 1, №2

A = int(input())
if A % 2 == 1:
    print ("True")
else:
    print ("False")
