# Доленко Дарья, РУДН, НБИбд-01-21, 25.06.22
# Задание 1, №26

x = int(input())
y = int(input())
if x > 0 and y < 0:
    print ("True")
else:
    print ("False")