# Доленко Дарья, РУДН, НБИбд-01-21, 25.06.22
# Задание 1, №8

A = int(input())
B = int(input())
if A % 2 == 1 and B % 2 == 1:
    print ("True")
else:
    print ("False")
