# Доленко Дарья, РУДН, НБИбд-01-21, 25.06.22
# Задание 2, №2

N = int(input())
if N > 0:
    N += 1
else:
    N -= 2
print (N)