# Доленко Дарья, РУДН, НБИбд-01-21, 25.06.22
# Задание 2, №25

x = int(input())
if x < -2 or x > 2:
    print ("f(x) =", 2 * x)
else:
    print ("f(x) =", -3 * x)