# Доленко Дарья, РУДН, НБИбд-01-21, 25.06.22
# Задание 1, №13, часть б

a = int(input())
x = 12*(a**2) + 7*a - 16
print(x)