# Доленко Дарья, РУДН, НБИбд-01-21, 25.06.22
# Задание 1, №15, часть б

import math
x = float(input())
y = math.sin((3.2 + math.sqrt(1+x))/(math.fabs(5*x)))
print(y)