# Доленко Дарья, РУДН, НБИбд-01-21, 25.06.22
# Задание 1, №20

import math
r = float(input())
L = 2 * math.pi * r
S = math.pi * (r**2)
print("Lenth =" , L)
print("Square =" , S)