# Доленко Дарья, РУДН, НБИбд-01-21, 25.06.22
# Задание 2, №2

import math
a = float(input())
S = a**2
print("Square =" , S)