# Доленко Дарья, РУДН, НБИбд-01-21, 25.06.22
# Задание 3, №2

import math

M = int(input())
Result = M // 1000

print(Result , "тонн")