# Доленко Дарья, РУДН, НБИбд-01-21, 25.06.22
# Задание 3, №7

import math

a = int(input())

aA = a % 10
Aa = a // 10

Sum = aA + Aa
Prod = aA * Aa

print("Сумма =" , Sum)
print("Произведение =" , Prod)